## **[MySQL Alias](https://www.mysqltutorial.org/mysql-alias/)**

Use MySQL alias to improve the readability of the queries.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### MySQL alias for columns

syntax:

SELECT 
   [column_1 | expression] AS descriptive_name
FROM table_name;

SELECT 
   [column_1 | expression] AS `descriptive name`
FROM 
   table_name;

In [3]:
string = '''
SELECT
    CONCAT_WS(', ', firstName, lastName) AS `Full Name`
FROM employees
ORDER BY `Full Name`
;'''

df1 = pd.read_sql(string, engine)

In [4]:
df2 = (
    pd.read_sql_table('employees', engine)
    .assign(**{'Full Name': lambda df_: df_.firstName.str.cat(
        df_.lastName, sep=', ', na_rep='-')})
    # .assign(FullName = lambda df_: df_.firstName.str.cat(
    #     df_.lastName, sep=', ', na_rep='-'))
    .sort_values(
        by='Full Name', ignore_index=True)
    [['Full Name']]
)

In [5]:
df1.equals(df2)

True

In [6]:
df1.head()

         Full Name
0     Andy, Fixter
1     Anthony, Bow
2     Barry, Jones
3    Diane, Murphy
4  Foon Yue, Tseng

In [7]:
string = '''
SELECT
    orderNumber `Order no.`,
    SUM(priceEach * quantityOrdered) total
FROM orderdetails
GROUP BY `Order no.`
HAVING total > 60000;
'''

df1 = pd.read_sql(string, engine)

In [8]:
df2 = (
    pd.read_sql_table('orderdetails', engine)
    .assign(total = lambda df_: df_.priceEach * df_.quantityOrdered)
    .groupby('orderNumber')
    .agg({'total': 'sum'})
    .query('total > 60000')
    .reset_index(drop=False)
    .rename(columns = {'orderNumber': 'Order no.'})
)

In [9]:
df1.equals(df2)

True

In [10]:
df1

   Order no.     total
0      10165  67392.85
1      10287  61402.00
2      10310  61234.67

### MySQL alias for tables

syntax: **table_name AS table_alias**

In [11]:
string = '''
SELECT e.firstName, e.lastName
FROM employees e
ORDER BY e.firstName
;'''

pd.read_sql(string, engine).head()

  firstName lastName
0      Andy   Fixter
1   Anthony      Bow
2     Barry    Jones
3     Diane   Murphy
4  Foon Yue    Tseng

In [12]:
string = '''
SELECT
    customerName,
    COUNT(o.customerNumber) total
FROM customers c
INNER JOIN orders o ON c.customerNumber = o.customerNumber
GROUP BY customerName
ORDER BY 
    total DESC, 
    customerName ASC
;'''

# same as
string1 = '''
SELECT
    customers.customerName,
    COUNT(orders.orderNumber) total
FROM
    customers
INNER JOIN  
    orders ON customers.customerNumber = orders.customerNumber
GROUP BY customerName
ORDER BY
    total DESC,
    customerName ASC
;'''

df1 = pd.read_sql(string, engine)

In [13]:
def key_upper(s):
    if s.dtypes == 'O':
        return s.str.upper()
    else:
        return s

df2 = (
    pd.read_sql_table('customers', engine)
    .merge(pd.read_sql_table('orders', engine),
           on='customerNumber', how='inner')
    .groupby('customerName')
    .agg(total = pd.NamedAgg(
        column='customerNumber', aggfunc='size'))
    .sort_values(
        by=['total', 'customerName'],
        ascending=[False, True],
        key = key_upper)
    .reset_index()
)

In [14]:
df1.equals(df2)

True

In [15]:
df1.head()

                   customerName  total
0        Euro+ Shopping Channel     26
1  Mini Gifts Distributors Ltd.     17
2    Australian Collectors, Co.      5
3      Danish Wholesale Imports      5
4    Down Under Souveniers, Inc      5